[
  {"text": "emergence", "definition": "The arising of complex systems or patterns from simple interactions.", "meaning": "創発。単純な要素の相互作用から複雑な秩序や構造が立ち上がる現象。"},
  {"text": "equilibrium", "definition": "A state of balance between opposing forces or influences.", "meaning": "均衡、平衡状態。対立する力や影響が釣り合って安定している状態。"},
  {"text": "resonance", "definition": "The amplification or reinforcement of a system’s natural frequency through alignment.", "meaning": "共鳴。波長やリズムが同調し、系が自然振動を増幅する現象。"},
  {"text": "feedback", "definition": "A process where a system’s output loops back as input, influencing future behavior.", "meaning": "フィードバック。出力が入力へと戻り、次の状態を変化させる循環的な制御機構。"},
  {"text": "entropy", "definition": "A measure of disorder or randomness in a system.", "meaning": "エントロピー。系の無秩序さやエネルギーの拡散度、予測不可能性を示す指標。"},
  {"text": "synergy", "definition": "Interaction that produces a combined effect greater than the sum of individual parts.", "meaning": "相乗効果。複数要素が相互作用して、単独よりも大きな効果を生む現象。"},
  {"text": "paradigm", "definition": "A model or framework that defines how something is understood or structured.", "meaning": "パラダイム。世界の理解や構造を規定する思考枠組み、模範。"},
  {"text": "causality", "definition": "The relationship between cause and effect within a system.", "meaning": "因果律。原因と結果の間に成立する必然的なつながり。"},
  {"text": "metacognition", "definition": "Awareness and understanding of one’s own thought processes.", "meaning": "メタ認知。自らの思考過程を客観的に認識・制御する能力。"},
  {"text": "fractal", "definition": "A self-similar pattern repeating at different scales within a system.", "meaning": "フラクタル。異なるスケールで自己相似的に繰り返される構造パターン。"},
  {"text": "resilience", "definition": "The capacity to recover or adapt quickly after disturbance or stress.", "meaning": "回復力、弾性。外的な揺らぎやストレスから柔軟に復元・適応する力。"},
  {"text": "dialectic", "definition": "Reasoning that explores truth through contradiction and synthesis.", "meaning": "弁証法。矛盾や対立を通して、より高次の統合（アウフヘーベン）へ至る思考法。"},
  {"text": "vector", "definition": "A quantity defined by both magnitude and direction; a carrier of force or information.", "meaning": "ベクトル。大きさと方向を持ち、力や情報を運ぶ指向性を持つ要素。"},
  {"text": "cognition", "definition": "The mental process of acquiring and interpreting knowledge.", "meaning": "認知。知識を獲得し、理解・判断・処理する精神的プロセス。"},
  {"text": "singularity", "definition": "A point at which a system’s state becomes undefined or transcendent.", "meaning": "特異点。通常の法則が適用できなくなり、系が爆発的な変化を起こす臨界点。"},
  {"text": "heuristic", "definition": "A rule-of-thumb approach that guides problem-solving through experience.", "meaning": "ヒューリスティック。厳密な解法ではなく、経験則に基づいて探索を効率化する発見的手法。"},
  {"text": "topology", "definition": "The structural arrangement or connectivity within a network or space.", "meaning": "トポロジー、位相。空間やネットワークにおける「つながり」や「配置」の構造的性質。"},
  {"text": "recursion", "definition": "A process that refers back to itself, generating self-similar outcomes.", "meaning": "再帰。自己を参照しながら繰り返すことで、入れ子構造や自己相似を生むプロセス。"},
  {"text": "abstraction", "definition": "The process of distilling complexity into essential conceptual form.", "meaning": "抽象化。複雑な現象から枝葉を捨て、本質的要素だけを抽出して構造化する操作。"},
  {"text": "continuum", "definition": "A seamless range or spectrum without discrete separation.", "meaning": "連続体。断絶のない連続的な広がりや変化の帯。"},
  {"text": "anomaly", "definition": "Something that deviates from what is standard, normal, or expected.", "meaning": "アノマリー。例外、変則、理論や法則から逸脱した特異な事象。"},
  {"text": "empirical", "definition": "Based on, concerned with, or verifiable by observation or experience rather than theory.", "meaning": "経験的な、実証的な。理論や空想ではなく、観測可能な事実に基づいていること。"},
  {"text": "synthesize", "definition": "Combine a number of things into a coherent whole.", "meaning": "統合する、合成する。異なる要素を組み合わせて、一つの整合性のある全体を作り出すこと。"},
  {"text": "catalyst", "definition": "A person or thing that precipitates an event.", "meaning": "触媒、カタリスト。それ自体は変化せずに、周囲の変化や反応を劇的に促進させる要因。"},
  {"text": "dichotomy", "definition": "A division or contrast between two things that are opposed or entirely different.", "meaning": "二分法。物事を二つの対立する（あるいは全く異なる）要素に明確に分けること。"},
  {"text": "axiom", "definition": "A statement or proposition which is regarded as being established, accepted, or self-evidently true.", "meaning": "公理。証明を必要とせず、議論や理論構築の前提として無条件に受け入れられる自明の真理。"},
  {"text": "holistic", "definition": "Characterized by comprehension of the parts of something as intimately interconnected.", "meaning": "全体論的な。部分の総和以上のものとして、システム全体を包括的・有機的に捉える視点。"},
  {"text": "autonomy", "definition": "Freedom from external control or influence; independence.", "meaning": "自律性。外部からの制御や干渉を受けず、自らの規範に従って動作する性質。"},
  {"text": "redundant", "definition": "Not or no longer needed or useful; superfluous (or system redundancy).", "meaning": "冗長な。余分であること。システム用語としては、障害に備えて予備がある状態。"},
  {"text": "liminal", "definition": "Occupying a position at, or on both sides of, a boundary or threshold.", "meaning": "境界の、閾（しきい）の。二つの状態の狭間や、移行過程にある曖昧な領域。" }
]